##### ДЗ. Тема 9. Жадібні алгоритми та динамічне програмування

### Завдання 1

'''
Опис домашнього завдання
У конспекті ми розглянули приклад про розбиття суми на монети. Маємо набір монет [50, 25, 10, 5, 2, 1]. 
Уявіть, що ви розробляєте систему для касового апарату, яка повинна визначити оптимальний спосіб видачі решти покупцеві.

Вам необхідно написати дві функції для касової системи, яка видає решту покупцеві:

    1) Функція жадібного алгоритму find_coins_greedy. 
Ця функція повинна приймати суму, яку потрібно видати покупцеві, і повертати словник із кількістю монет кожного номіналу, 
що використовуються для формування цієї суми. Наприклад, для суми 113 це буде словник {50: 2, 10: 1, 2: 1, 1: 1}. 
Алгоритм повинен бути жадібним, тобто спочатку вибирати найбільш доступні номінали монет.
    
    2) Функція динамічного програмування find_min_coins. 
Ця функція також повинна приймати суму для видачі решти, але використовувати метод динамічного програмування, 
щоб знайти мінімальну кількість монет, необхідних для формування цієї суми. 
Функція повинна повертати словник із номіналами монет та їх кількістю для досягнення заданої суми найефективнішим способом. 
Наприклад, для суми 113 це буде словник {1: 1, 2: 1, 10: 1, 50: 2}

Порівняйте ефективність жадібного алгоритму та алгоритму динамічного програмування, 
базуючись на часі їх виконання або О великому та звертаючи увагу на їхню продуктивність при великих сумах. 
Висвітліть, як вони справляються з великими сумами та чому один алгоритм може бути більш ефективним за інший у певних ситуаціях. 
Свої висновки додайте у файл readme.md домашнього завдання.

Критерії прийняття ДЗ
Прикріплені посилання на репозиторій goit-algo-hw-09 та безпосередньо сам файл репозиторію у форматі zip.
Програмно реалізовано функцію, яка використовує принцип жадібного алгоритму. Код виконується і повертає словник з кількістю монет кожного номіналу, що використовуються для формування певної суми. Спочатку вибираються найбільш доступні номінали монет.
Програмно реалізовано функцію, яка використовує принцип динамічного програмування. Код виконується і повертає словник з номіналами монет та їх кількістю для досягнення заданої суми найефективнішим способом.
На основі оцінювання часу виконання кожного з двох алгоритмів або О великого визначено найбільш ефективний при великих сумах алгоритм.
Зроблено висновки щодо ефективності алгоритмів для даного випадку. Висновки оформлено у вигляді файлу readme.md домашнього завдання.

'''

import timeit

def measure_time(search_func, target, initial_bills):
    start_time = timeit.default_timer()
    search_data = search_func(target, initial_bills)
    end_time = timeit.default_timer() - start_time
    return end_time


### 1) Функція жадібного алгоритму find_coins_greedy.

def find_coins_greedy(amount, denominations):
    result = {}

    for denom in denominations:      # для кожного номіналу купюри зі списку купюр
        count = amount // denom       # кількість купюр кожного номіналу, яких можна взяти
        if count > 0:
            result[denom] = count
            amount -= denom * count

    return result

if __name__ == "__main__":
    # Приклад використання:
    
    # Доступні номінали купюр (в гривнях), від найбільшої до найменшої
    denominations = [50, 25, 10, 5, 2, 1]
    targets = [113, 12345]
    for target_sum in targets:
        change = find_coins_greedy(target_sum, denominations)

        print('\n1) Жадібний алгоритм:\n')
        print(f"Сума: {target_sum} грн")
        print("Купюри:")
        for denom, count in change.items():
            print(f"{denom} грн x {count} шт")
        
        print(f'Словник результатів жадібного алгоритму {change}')

        greedy_algorithm_time = measure_time(find_coins_greedy, target_sum, denominations)
        print(f'{greedy_algorithm_time} Час виконання Жадібного алгоритму для суми {target_sum}')


### 2) Функція динамічного програмування find_min_coins


# Знайти, як видати задану суму з наявних купюр так, щоб:
# - не перевищити наявну кількість кожного номіналу;
# - знайти комбінацію з мінімальною кількістю купюр.


def find_min_coins(amount, bills):
    """
    amount: int - сума, яку потрібно видати
    bills: dict {номінал: кількість} - наявні купюри
    Повертає dict {номінал: кількість} або None, якщо неможливо.
    """

    denominations = sorted(bills.keys())
    max_amount = amount + 1

    # dp[i] = None або словник {номінал: кількість} для суми i (📚 Динамічне програмування (dp) )
    dp = [None] * (max_amount)       # dp[i] — словник {номінал: кількість}, щоб зібрати суму 'i';         створюємо список із None довжиною в max_amount
    dp[0] = {}                       # dp[0] = {} — базовий випадок: 0 грн — це "пустий набір купюр".    1-ше значення списку - порожній словник, в який буде додаватися {номінал: кількість}

    for i in range(1, max_amount):                                      # Для кожної суми 'i' від 1 до max_amount = 51 
        for denom in denominations:                                      # пробуємо всі номінали denom, щоб подивитися, чи можна дійти до 'i', додавши denom до вже зібраної 'i' - denom.
            if denom <= i and dp[i - denom] is not None:                 # Якщо можна використати denom для створення суми 'i' та dp[i - denom] вже має розв’язок.
                # Перевіряємо, чи є ще доступні купюри denom
                prev = dp[i - denom]                                      # беремо вже наявну комбінацію prev;
                count = prev.get(denom, 0)
                if count < bills[denom]:                                  # перевіряємо, чи ми ще не вичерпали купюри denom.
                    # Формуємо новий словник з додаванням купюри denom
                    new_combo = prev.copy()                               # Формуємо нову комбінацію
                    new_combo[denom] = count + 1

                    # Якщо dp[i] ще немає або знайшли кращий варіант (з меншим числом купюр)
                    if dp[i] is None or sum(new_combo.values()) < sum(dp[i].values()):        # Вибираємо найкращу (найменше купюр)
                        dp[i] = new_combo
    return dp[amount]                                                                         # Повертає оптимальну комбінацію купюр або None, якщо неможливо.


if __name__ == '__main__':
    denominations = [50, 25, 10, 5, 2, 1]
    initial_bills = {}
    for denom in denominations:
         initial_bills.update({denom: 1000})                  # створюємо словник, що кількості номіналу кожної купюри було по 1000 штук

    # Виведення: Варіант 1. Коротке чітке виконання алгоритму
    print('\n2) Алгоритм динамічного програмування:')
    test_sums = [113, 12345]

    for target in test_sums:
        print(f"\nСпроба зняти {target} грн:")
        result = find_min_coins(target, initial_bills)
        if result is not None:
            for denom, count in sorted(result.items(), reverse=False):
                print(f"{denom} грн x {count}")
            sorted_by_keys = dict(sorted(result.items()))
            print(f'Словник результатів алгоритму динамічного програмування {sorted_by_keys }')
            dynamic_programming_time = measure_time(find_coins_greedy, target, initial_bills)
            print(f'{dynamic_programming_time} Час виконання Алгоритму динамічного програмування для суми {target}')
        else:
            print("неможливо видати")

# Висновок

'''

Для суми 113 та суми 12345 швидше спрацював Жадібний алгоритм, ніж Алгоритм динамічного програмування, а саме:

3.40002 Час виконання Жадібного алгоритму для суми 113
3.59991 Час виконання Жадібного алгоритму для суми 12345

3.50003 Час виконання Алгоритму динамічного програмування для суми 113
5.70004 Час виконання Алгоритму динамічного програмування для суми 12345

Таким чином: 
Жадібний алгоритм працює дуже швидко, простий у реалізації, але не гарантує мінімальну кількість монет для довільного набору номіналів (може бути неоптимальне рішення).
Динамічне програмування повільніше, особливо при великих сумах (повільніше через побудову таблиці розміром 12345 в прикладі), але гарантує найменшу кількість монет (обов'язково буде оптимальне рішення).
При великій кількості номіналів або при "нестандартних" монетах жадібний алгоритм може дати неоптимальний результат.
Якщо потрібна швидкість — використовуємо жадібний підхід. Якщо потрібна мінімальна кількість монет — динамічне програмування.
'''